IdeaRS.OpenModel.WeldingTypeSNIP
Welding types defined in SP16-Table 39

IdeaRS.OpenModel.WeldingTypeSNIP.Manual
Manual welding

IdeaRS.OpenModel.WeldingTypeSNIP.ManualSmallRodDiam
Manual welding using rod solid cross-section with diameter less than 1.4mm

IdeaRS.OpenModel.WeldingTypeSNIP.AutomaticAndMachine
Automatic and machine welding

IdeaRS.OpenModel.WeldingTypeSNIP.Automatic
Automatic welding